

from handproc import *

    

if __name__=='__main__':

    res=jy_proc([r'\\sz03sjnas03\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\05-转向测试\02-竞品\03-奥迪\A8L\A8L-0936_D-大型车_轿车_有数据\J-20210500905_vin_国内_有模式差异_参考\归档数据\标准模式_标准模式\JY\0.3-4.txt'],[0,2,10,7,8,11])

    res=jsfy_proc([r'\\sz03sjnas03\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\02-宝马\iX\iX-2022款-xDrive50欧版_C-中大型车_SUV\J-20231004965\归档数据\舒适模式_舒适模式\加速俯仰\SS-0.2-2.txt',

               r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\10-雷克萨斯\LX600\LX600-8251_越野_越野\J-20230405817\归档数据\运动模式_标准模式\JSFY\0.15-2.txt',

               r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\10-雷克萨斯\LX600\LX600-8251_越野_越野\J-20230405817\归档数据\运动模式_标准模式\JSFY\QL-2.txt',

               r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\10-雷克萨斯\LX600\LX600-8251_越野_越野\J-20230405817\归档数据\运动模式_标准模式\JSFY\0.25-2.txt',

               r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\10-雷克萨斯\LX600\LX600-8251_越野_越野\J-20230405817\归档数据\运动模式_标准模式\JSFY\0.25-1.txt',

               r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\10-雷克萨斯\LX600\LX600-8251_越野_越野\J-20230405817\归档数据\运动模式_标准模式\JSFY\0.1-1.txt',

               r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\10-雷克萨斯\LX600\LX600-8251_越野_越野\J-20230405817\归档数据\运动模式_标准模式\JSFY\0.1-2.txt',

                ],[1,2,6,11])

    res=zdfy_proc([r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\10-雷克萨斯\LX600\LX600-8251_越野_越野\J-20230405817\归档数据\运动模式_标准模式\ZDFY\0.2-1.txt',

                r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\10-雷克萨斯\LX600\LX600-8251_越野_越野\J-20230405817\归档数据\运动模式_标准模式\ZDFY\0.2-2.txt'],[1,2,6,11])

    res=zxq_proc([

        r'\\sz03sjnas03\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\02-宝马\i3\i3-3034_B-中型车_轿车\J-2016080237\归档数据\标准模式_标准模式\BTCS\100-2.txt',

        r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\05-本田\N-BOX\N-BOX_A00-微型车_微型车\J-20231101508\归档数据\标准模式_标准模式\BTCS\100-3.txt',

        r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\04-大众\ID3\ID3-欧版3832_A-紧凑型车_轿车\J-20230402014\归档数据\标准模式_舒适模式\BTCS\40-3.txt',

        r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\04-大众\ID3\ID3-欧版3832_A-紧凑型车_轿车\J-20230402014\归档数据\标准模式_舒适模式\BTCS\40-4.txt',

        r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\04-大众\ID3\ID3-欧版3832_A-紧凑型车_轿车\J-20230402014\归档数据\标准模式_运动模式\ZXQ\100-99.txt',

        r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\04-大众\ID3\ID3-欧版3832_A-紧凑型车_轿车\J-20230402014\归档数据\标准模式_运动模式\ZXQ\100-1111.txt',

                  ],[1,10,7,9,8,14])

    res=xcxjsd_proc([

            r'\\sz03sjnas03\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\06-丰田\凯美瑞\凯美瑞 2023款_B-中型车_轿车\J-20240105552\归档数据\标准模式_标准模式\XCXJSD\1.txt',

            r'\\sz03sjnas03\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\06-丰田\凯美瑞\凯美瑞 2023款_B-中型车_轿车\J-20240105552\归档数据\标准模式_标准模式\XCXJSD\2.txt',

            r'\\sz03sjnas03\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\06-丰田\凯美瑞\凯美瑞 2023款_B-中型车_轿车\J-20240105552\归档数据\标准模式_标准模式\XCXJSD\3.txt',

            r'\\sz03sjnas03\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\06-丰田\凯美瑞\凯美瑞 2023款_B-中型车_轿车\J-20240105552\归档数据\标准模式_标准模式\XCXJSD\4.txt',

            r'\\sz03sjnas03\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\06-丰田\凯美瑞\凯美瑞 2023款_B-中型车_轿车\J-20240105552\归档数据\标准模式_标准模式\XCXJSD\5.txt',

            r'\\sz03sjnas03\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\06-丰田\凯美瑞\凯美瑞 2023款_B-中型车_轿车\J-20240105552\归档数据\标准模式_标准模式\XCXJSD\6.txt',

            ],[1,2,10,7,9])

    res=wthz_proc([

        r'\\Sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\21-长城\坦克500Hi4\坦克500Hi4-z-8641_越野_越野\J-20250204384\归档数据\标准模式_运动模式\WTHZ\1-edit250507.txt',

        r'\\Sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\21-长城\坦克500Hi4\坦克500Hi4-z-8641_越野_越野\J-20250204384\归档数据\标准模式_运动模式\WTHZ\2-edit250507.txt',

        r'\\Sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\21-长城\坦克500Hi4\坦克500Hi4-z-8641_越野_越野\J-20250204384\归档数据\标准模式_运动模式\WTHZ\3-edit250507.txt',

        r'\\Sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\21-长城\坦克500Hi4\坦克500Hi4-z-8641_越野_越野\J-20250204384\归档数据\标准模式_运动模式\WTHZ\4-edit250507.txt',

        r'\\Sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\21-长城\坦克500Hi4\坦克500Hi4-z-8641_越野_越野\J-20250204384\归档数据\标准模式_运动模式\WTHZ\5-edit250507.txt',

        r'\\Sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\21-长城\坦克500Hi4\坦克500Hi4-z-8641_越野_越野\J-20250204384\归档数据\标准模式_运动模式\WTHZ\6-edit250507.txt',

        ],[1,10,7,8,11,9,7,7],14.64)

    res=btcs_proc([

        r'\\sz03sjnas03\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\02-宝马\i3\i3-3034_B-中型车_轿车\J-2016080237\归档数据\标准模式_标准模式\BTCS\100-2.txt',

        r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\05-本田\N-BOX\N-BOX_A00-微型车_微型车\J-20231101508\归档数据\标准模式_标准模式\BTCS\100-3.txt',

        r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\04-大众\ID3\ID3-欧版3832_A-紧凑型车_轿车\J-20230402014\归档数据\标准模式_舒适模式\BTCS\40-3.txt',

        r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\04-大众\ID3\ID3-欧版3832_A-紧凑型车_轿车\J-20230402014\归档数据\标准模式_舒适模式\BTCS\40-4.txt',

        r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\04-大众\ID3\ID3-欧版3832_A-紧凑型车_轿车\J-20230402014\归档数据\标准模式_运动模式\ZXQ\100-99.txt',

        r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\04-大众\ID3\ID3-欧版3832_A-紧凑型车_轿车\J-20230402014\归档数据\标准模式_运动模式\ZXQ\100-1111.txt',

                  ],[1,10,7,9,8,14])

    res=qlzd_proc([r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\02-竞品\06-丰田\普锐斯\丰田普锐斯_A-紧凑型车_轿车\VD_CW_20251024_丰田普锐斯\归档数据\标准模式_标准模式\3公里0.3g制动\24-10-2510-36-35.csv'])

    res=qifu_proc([

                r'\\sz03sjnas03\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\01-BYD\02-海洋\UNH\UNHB-9023_A-紧凑型车_SUV\VD_CW_20250730_UNHB9023\原始数据\运动\高环起伏\30-07-2509-22-17.csv',

                ])

    res=jmc_proc([r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\03-操稳测试\01-BYD\01-王朝\STH\STHZA-6910_B-中型车_SUV\VD_CW_20250302_STHZA6910\归档数据\舒适模式_标准模式\120公里角脉冲\02-03-2510-42-21.csv'])

    res=dshz_proc([r'\\sz03sjnas03\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\05-转向测试\02-竞品\04-大众\速腾\速腾-7309_A-紧凑型车_轿车_有数据\J-20231204138_vin_国内_无模式差异_优秀\归档数据\标准模式_标准模式\DSHZ\1.txt'],[10,1,8,13]) # '方向盘转角', '时间', '横摆角速度', '转角速度'

    res=gshz_proc([r'\\sz03sjnas03\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\05-转向测试\02-竞品\04-大众\速腾\速腾-7309_A-紧凑型车_轿车_有数据\J-20231204138_vin_国内_无模式差异_优秀\归档数据\标准模式_标准模式\GSHZ\1.txt'],[10,1,8,13]) # '方向盘转角', '时间', '横摆角速度', '转角速度'

    res=ydds_proc([r'\\sz03sjnas03\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\05-转向测试\02-竞品\04-大众\速腾\速腾-7309_A-紧凑型车_轿车_有数据\J-20231204138_vin_国内_无模式差异_优秀\归档数据\标准模式_标准模式\YD\10-1.txt'],[10,13,12,9]) # '方向盘转角', '转角速度','转向盘力','转向盘力矩'

    res=qxc_proc([r'\\sz03sjnas03\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\05-转向测试\02-竞品\05-丰田\汉兰达\汉兰达-VD_B-中型车_SUV_有数据\VD-CW20250409_vin_国内_无模式差异_参考\归档数据\标准模式_标准模式\全行程回正\09-04-2514-42-04.csv'],[4,0,3]) #'方向盘转角', '时间', '转角速度'

    res=dszxl_proc([r'\\sz03sjnas03\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\05-转向测试\02-竞品\04-大众\速腾\速腾-7309_A-紧凑型车_轿车_有数据\J-20231204138_vin_国内_无模式差异_优秀\归档数据\标准模式_标准模式\DS\1.txt'],[10,13,12,9]) # '方向盘转角', '转角速度', '转向盘力', '转向盘力矩'

    res=zxqhx_proc([r'\\sz03sjnas03\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\05-转向测试\02-竞品\05-丰田\汉兰达\汉兰达-VD_B-中型车_SUV_有数据\VD-CW20250409_vin_国内_无模式差异_参考\归档数据\标准模式_标准模式\中心区换向\09-04-2514-29-51.csv'],[10,9]) # '方向盘转角', '转向盘力矩'

    res=jxwzhx_proc([r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\05-转向测试\02-竞品\19-问界\问界M9\问界M9-VD_D-大型车_SUV_有数据\VD-CW20251121_vin_国内_有模式差异_参考\归档数据\标准模式_舒适模式\极限位置换向\24-11-2519-38-45.csv',

                     ],[16,4]) #'方向盘转角', '转向盘力矩'

    res=dlgjsd_proc([r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\05-转向测试\02-竞品\19-问界\问界M9\问界M9-VD_D-大型车_SUV_有数据\VD-CW20251121_vin_国内_有模式差异_参考\归档数据\标准模式_舒适模式\单轮过减速带@20\24-11-2515-28-41.csv'],[0,4,2]) # '时间', '方向盘转角', '转向盘力矩'

    res=catchup_proc([r'\\sz03sjnas01\ctdc01\VD性能开发部\★机密★02-公共资料\17-归档数据\05-转向测试\02-竞品\19-问界\问界M9\问界M9-VD_D-大型车_SUV_有数据\VD-CW20251121_vin_国内_有模式差异_参考\归档数据\标准模式_舒适模式\Catch Up\24-11-2520-00-44.csv'],[16,2,2]) # '方向盘转角', '转向盘力','转向盘力矩'

    pass


